const reg = {
  // 昵称：限6-18个字符，限汉字、字母、数字，符号，字母不区分大小写(即匹配非空白字符)
  nickName: /^\S{6,18}$/,
  // 支持 GIF、JPG、JPEG、PNG 图片格式
  pic: /[jpg|gif|png|jpeg]$/g,
  // 只能填写中文或者只能填英文，限2-18个字符
  name: /^[\u4e00-\u9fa5]{2,18}$|^[A-Za-z]{2,18}$/,
  // 只能填写中文或者只能填英文，限20个字符
  company: /^[\u4e00-\u9fa5]{1,20}$|^[A-Za-z]{1,20}$/,
  // 需要符合邮箱格式，否则提示“邮箱格式有误！
  emial: /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/,
  // 只能填写中文或英文，限2-18个字符
  name: /^[\u4e00-\u9fa5|A-Za-z]{2,18}$/,
}

module.exports = {
  reg
}
